{"keras_version": "2.3.0-tf", "backend": "tensorflow", "class_name": "Sequential", "config": {"build_input_shape": [null, 28, 28, 1], "layers": [{"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d", "batch_input_shape": [null, 28, 28, 1], "data_format": "channels_last", "activity_regularizer": null, "kernel_size": [4, 4], "bias_regularizer": null, "padding": "valid", "dtype": "float32", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "filters": 32, "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "name": "max_pooling2d", "data_format": "channels_last", "trainable": true, "padding": "valid", "dtype": "float32", "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten", "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense", "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "kernel_constraint": null, "dtype": "float32", "bias_regularizer": null, "units": 128, "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "activity_regularizer": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "kernel_constraint": null, "dtype": "float32", "bias_regularizer": null, "units": 10, "trainable": true, "activation": "softmax"}}], "name": "sequential"}}